{"vocab_size": 32128, "d_model": 512, "d_kv": 64, "d_ff": 2048, "num_layers": 6, "num_decoder_layers": 6, "num_heads": 8, "relative_attention_num_buckets": 32, "relative_attention_max_distance": 128, "dropout_rate": 0.1, "layer_norm_epsilon": 1e-06, "initializer_factor": 1.0, "feed_forward_proj": "relu", "use_cache": true, "dense_act_fn": "relu", "is_gated_act": false, "return_dict": true, "output_hidden_states": false, "output_attentions": false, "torchscript": false, "torch_dtype": "float32", "use_bfloat16": false, "tf_legacy_loss": false, "pruned_heads": {}, "tie_word_embeddings": true, "is_encoder_decoder": true, "is_decoder": false, "cross_attention_hidden_size": null, "add_cross_attention": false, "tie_encoder_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "num_beam_groups": 1, "diversity_penalty": 0.0, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "typical_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "encoder_no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "chunk_size_feed_forward": 0, "output_scores": false, "return_dict_in_generate": false, "forced_bos_token_id": null, "forced_eos_token_id": null, "remove_invalid_values": false, "exponential_decay_length_penalty": null, "suppress_tokens": null, "begin_suppress_tokens": null, "architectures": ["EffT5ForConditionalGeneration"], "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "tokenizer_class": null, "prefix": null, "bos_token_id": null, "pad_token_id": 0, "eos_token_id": 1, "sep_token_id": null, "decoder_start_token_id": 0, "task_specific_params": {"summarization": {"early_stopping": true, "length_penalty": 2.0, "max_length": 200, "min_length": 30, "no_repeat_ngram_size": 3, "num_beams": 4, "prefix": "summarize: "}, "translation_en_to_de": {"early_stopping": true, "max_length": 300, "num_beams": 4, "prefix": "translate English to German: "}, "translation_en_to_fr": {"early_stopping": true, "max_length": 300, "num_beams": 4, "prefix": "translate English to French: "}, "translation_en_to_ro": {"early_stopping": true, "max_length": 300, "num_beams": 4, "prefix": "translate English to Romanian: "}}, "problem_type": null, "_name_or_path": "../cnndm_t5_small_run2", "transformers_version": "4.28.1", "copy_skipped_hidden_states": false, "distill_layer_alpha": null, "do_layer_transformation": false, "exit_conf_threshold": 0.05, "exit_conf_type": "MLP", "exit_min_layer": 1, "exit_position_temp": null, "intermediate_loss_fn": null, "lora_alpha": 8, "lora_dropout": 0.1, "lora_rank": 8, "lora_target_modules": null, "max_answer_length": 128, "model_type": "t5", "n_positions": 512, "output_hidden_states_decoder": false, "output_past": true, "parallel_causal_mask": true, "parallel_gen_token": true, "rollback_conf_threshold": null, "shallow2deep_conf_threshold": 1.0, "shallow2deep_conf_type": null, "shallow_exit_layer": null, "static_exit_layer": null, "train_meta_cm_head": false, "use_adapt_threshold": false, "use_early_exit": true, "use_lora": false, "use_shallow_deep": false, "use_synchronize": true}